# Space_GetGrossArea

## Description
Returns gross area of given space object

```pascal
FUNCTION Space_GetGrossArea(space : HANDLE): REAL;
```

```python
def vs.Space_GetGrossArea(space):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools